[
  {
    "version": "1.0.3",
    "entries": [
      "Added a new README.md file for improved project documentation.",
      "Fixed the issue with recommended posts display.",
      "Resolved testing issues to ensure smoother functionality."
    ],
    "repositoryUrl": "https://github.com/jabistro/flashback",
    "createdAt": "2025-03-14T23:48:40.282Z"
  },
  {
    "version": "2.0.7",
    "entries": [
      "Added autofocus functionality to the \"Generate\" button for a smoother user experience.",
      "Updated the logo with a new design for a refreshed look.",
      "Removed the alert notification upon file upload completion.",
      "Adjusted localhost addresses to now display the backend address for improved clarity and functionality."
    ],
    "repositoryUrl": "https://github.com/jabistro/intellipics",
    "createdAt": "2025-03-14T23:49:17.898Z"
  },
  {
    "version": "3.0.3",
    "entries": [
      "Fixed a bug related to the 'joined' date not being set correctly on user creation.",
      "Added functionality to set the 'joined' date for users.",
      "Improved user experience by fixing bugs related to cascade deletion in albums and images, resolving a signup issue, and refactoring the user albums page for better performance.",
      "Added a new render script to enhance rendering capabilities.",
      "Streamlined the codebase by performing cleanup and refactoring tasks."
    ],
    "repositoryUrl": "https://github.com/jabistro/survivr",
    "createdAt": "2025-03-14T23:49:49.863Z"
  },
  {
    "version": "1.0.1",
    "entries": [
      "Added a complete dashboard on the frontend with performance statistics.",
      "Implemented the dashboard functionality on the backend, including affiliate statistics and user performance tracking.",
      "Introduced a new performance scene for enhanced user experience.",
      "Integrated an admin scene with the addition of admins, user performance details, and a DataGridCustomColumnMenu component on the backend."
    ],
    "repositoryUrl": "https://github.com/jabistro/ecomvision",
    "createdAt": "2025-03-14T23:55:36.843Z"
  }
]